{
    "Head" : {
      "name" : "Soeun",
      "home" : "HOME",
      "about" : "ABOUT",
      "project": "PROJECT",
      "contact" : "CONTACT",
      "education" : "EDUCATION"
    },

    "About" : {
        "morning": "Good morning, ",
        "afternoon": "Good afternoon, ",
        "evening": "Good evening, ",
        "my": "my name is",
        "name": "SOEUN PARK",
        "introduction":  "This is Soeun Park's Portfolio Page",
        "self": "I am a computer engineering student at California State University, Fullerton.",
        "selfDesOne": "From a young age, my passion for gaming naturally led me into the world of technology and development. Living in various countries has deepened my understanding of cultural diversity and the importance of identity, leading to volunteer work teaching the Korean language and culture. This volunteer work went beyond merely spreading Korean culture; it allowed me to share my experiences, knowledge, and interests with many others, enriching my perspective. This notion has expanded through my academic pursuits and various projects. From my childhood in the Czech Republic to the present, I have always harbored a passion for learning something new, even amidst changing environments.",
        "selfDesTwo": "My internship experience with a domestic company provided me with practical knowledge and highlighted the importance of collaborating with experts from different fields to solve problems. This experience has made me more open-minded and adaptable, understanding the core principles of programming, problem-solving techniques, and the value of teamwork. Based on these experiences, I have focused on projects that enhance user experience and tackle technical challenges, thereby honing my skills.",
        "selfDesThree": "My career goal transcends the mere use of technology; I aim to explore how technology can transform and improve people's lives. To this end, I have continuously developed a deep understanding across various tech domains and the ability to communicate and collaborate effectively with people from diverse backgrounds. Moving forward, I aspire to keep learning new knowledge, embracing challenges, and serving as a bridge between technology and people, growing as an engineer who fosters connections in the digital world.",
        "resume": "Download Resume",
        "langKor": "Korean",
        "langEng": "English",
        "langJap": "Japanese",
        "skillDescription": "I am able to work with diverse languages and programs such as C/C++, VHDL, Verilog, Assembly language, HTML, CSS, JavaScript (TypeScript), MATLAB, NextJS, ExpressJS, Adobe Premiere Pro, photoshop, and animation."
    },

    "Contact": {
      "copy": "email address is copied to clipboard",
      "copyFail": "Copy failed.",
      "description": "If you are interested, please contact with following contact information",
      "title": "Contact Me",
      "resume": "Download Resume",
      "resumeLink":"https://drive.google.com/file/d/1yMbMFXt8BQWSGSDKMMum30N19-S5i86N/view?usp=sharing"
    },

    "Project": {
      "description": "Following projects are the works I have done. The title of the projects and the programming languages used are listed. If you click the cards, you can check detailed information and files. (Updating)",
      "projectList": {
        "Portfolio": {
          "lang": "React (Vite), Typescript",
          "title": "Portfolio",
          "date": "January 2024",
          "context": "Portfolio page (this webpage) to introduce myself. For user's convenience, darkmode and translation (i18n) are applied.",
          "buttonLink": "https://github.com/datain01/port-page"
        },
        "LensGame": {
          "lang": "C#",
          "title": "Lens Enhance Simulation game",
          "date": "April 2024 (TDA)",
          "context": "Unity 2D game project. Simulation game that runs a shop that strengthens glasses lenses, currently in production.",
          "buttonLink": "https://github.com/datain01/Lentz"
        },
        "halfRandom": {
          "lang": "React, TypeScript",
          "title": "Half-Random Nickname Generator",
          "date":"September 2023",
          "context": "A random nickname generator for a game called, Maplestory. The user can type one letter and then generate random letters for rest of the space. There are three types of buttons to generate two letters, three letters, and six letters nickname.",
          "buttonLink": "https://github.com/datain01/half-nyehuing"
        },
        "TwitterClone": {
          "lang": "NextJS, ExpressJS, PostgreSQL, typeORM, Docker",
          "title": "Twitter Clone Coding",
          "date": "October 2023",
          "context": "Clone coding of the twitter to study NextJS, ExpressJS, PostgreSQL, typeORM, Docker, and bootstrap. To study the commonly used micro-service architecture system.",
          "buttonLink": "https://github.com/datain01/twtClone"
        },
        "StatCalc": {
          "lang": "HTML, JavaScript/TypeScript",
          "title": "Game Stats Simulator",
          "date": "June 2023",
          "context": "A simulation calculator for a game called, Maplestory. This is for calculating a system called hyper stats in the game.",
          "buttonLink": "https://github.com/datain01/hyperCalc"
        },        
        "RealVoice": {
          "lang": "MATLAB",
          "title": "Real-Time Voice Shifter",
          "date": "December 2023",
          "context": "Offering interactive pitch shifting and echo effects directly. Users can adjust the pitch to higher or lower tones and add degrees of echo actively using sliders.",
          "buttonLink": "https://github.com/datain01/voice"
        },
        "UpDown": {
          "lang": "Verilog",
          "title": "Up-Down Guessing Game",
          "date": "December 2023",
          "context": "Guessing 7-bit number with switch input. The system compares guessed number and the actual number and determines whether high or low. If the user guesses correctly in 10 chances, the user wins.",
          "buttonLink": "https://github.com/datain01/updown"
        },
        "TrafficLight": {
          "lang": "C",
          "title": "Intersection traffic light controller",
          "date": "October 2023",
          "context": "It is a system that controls the traffic lights of cars and pedestrians at the intersection based on FSM state. It can be tested directly with the MSP432 microcontroller board.",
          "buttonLink": "https://github.com/datain01/trafficControl"
        },
        "Blinkcon": {
          "lang": "Assembly",
          "title": "Blink Controller",
          "date": "September 2023",
          "context": "Interfacing a switch and an LED with the MSP 432 board. The actual switch and LED are attached to the breadboard. The circuit was tested with Multisim.",
          "buttonLink": "https://github.com/datain01/blinkControl"
        },
        "Cache": {
          "lang": "C++",
          "title": "Cache Hit Ratio Calculator",
          "date": "November 2022",
          "context": "For studying cache hit and cache miss concepts. There are four ways to calculate Fibonacci numbers and calculated cache hit ratios according to the number of test cases.",
          "buttonLink": "https://github.com/datain01/cacheHit"
        }        
      }
    },

    "timeline": {
      "elementarySchool": {
        "date": "2011-2014",
        "title": "International School of Prague",
        "description": "Attend the international school from 4th grade to 7th grade, which is located in Prague, Czech Republic."
      },
      "highSchoolFirst": {
        "date": "2017-2018",
        "title": "Pungduck High School",
        "description": "Attended high school until 11th grade, which is located in Sugi-gu, Korea."
      },
      "highSchoolSecond": {
        "date": "2018-2020",
        "title": "Northwood High School",
        "description": "Attended high school from 11th grade to 12th grade, which is located in California, United States."
      },
      "university": {
        "date": "2020-Now",
        "title": "California State University, Fullerton",
        "description": "Have attended university and expect to grade in 2024, computer engineering B.S. major undergraduate."
      }
    }
  }
  